app/controllers/articles_controller.rb

    def update
        @article = Article.find(params[:id])
        @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "sdfdsgsdfgsdg"], ["body", ""], ["updated_at", "2017-07-25 15:16:38.150906"], ["id", 2]]

    def destroy
        @article = Article.find(params[:id]).destroy
---
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 3]]
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]